#### Terraform Staging Format and Style 🖌 `success`
#### Terraform Staging Initialization ⚙️ `success`
#### Terraform Staging Validation 🤖 `success`
<details><summary>Staging Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Staging Plan 📖 `success`

<details><summary>Show Staging Plan</summary>

```

terraform
data.databricks_current_user.service_principal: Reading...
data.databricks_current_user.service_principal: Read complete after 0s [id=8027122424808776]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # databricks_job.batch_inference_job will be created
  + resource "databricks_job" "batch_inference_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "staging-mlops-stacks-102-nofs-batch-inference-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "main"
          + provider = "gitHub"
          + url      = "https://github.com/cylee-db/mlops-stacks-102-nofs"
        }

      + new_cluster {
          + custom_tags                  = {
              + "clusterSource" = "mlops-stack/0.0"
            }
          + data_security_mode           = "SINGLE_USER"
          + driver_instance_pool_id      = (known after apply)
          + driver_node_type_id          = (known after apply)
          + enable_elastic_disk          = (known after apply)
          + enable_local_disk_encryption = (known after apply)
          + node_type_id                 = "i3.xlarge"
          + num_workers                  = 3
          + single_user_name             = "d45ea715-5278-42ae-b99c-07a6c4b4cd90"
          + spark_version                = "11.0.x-cpu-ml-scala2.12"
        }

      + notebook_task {
          + base_parameters = {
              + "env"               = "staging"
              + "input_table_name"  = ""
              + "output_table_name" = "mlopsstacks102nofs_predictions"
            }
          + notebook_path   = "notebooks/BatchInference"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 11 * * ?"
          + timezone_id            = "UTC"
        }
    }

  # databricks_job.model_training_job will be created
  + resource "databricks_job" "model_training_job" {
      + always_running      = false
      + format              = (known after apply)
      + id                  = (known after apply)
      + max_concurrent_runs = 1
      + name                = "staging-mlops-stacks-102-nofs-model-training-job"
      + url                 = (known after apply)

      + git_source {
          + branch   = "main"
          + provider = "gitHub"
          + url      = "https://github.com/cylee-db/mlops-stacks-102-nofs"
        }

      + schedule {
          + pause_status           = (known after apply)
          + quartz_cron_expression = "0 0 9 * * ?"
          + timezone_id            = "UTC"
        }

      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "Train"

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "i3.xlarge"
              + num_workers                  = 3
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env" = "staging"
                }
              + notebook_path   = "notebooks/Train"
            }
        }
      + task {
          + retry_on_timeout = (known after apply)
          + task_key         = "TriggerModelDeploy"

          + depends_on {
              + task_key = "Train"
            }

          + new_cluster {
              + custom_tags                  = {
                  + "clusterSource" = "mlops-stack/0.0"
                }
              + data_security_mode           = "SINGLE_USER"
              + driver_instance_pool_id      = (known after apply)
              + driver_node_type_id          = (known after apply)
              + enable_elastic_disk          = (known after apply)
              + enable_local_disk_encryption = (known after apply)
              + node_type_id                 = "i3.xlarge"
              + num_workers                  = 3
              + single_user_name             = "d45ea715-5278-42ae-b99c-07a6c4b4cd90"
              + spark_version                = "11.0.x-cpu-ml-scala2.12"
            }

          + notebook_task {
              + base_parameters = {
                  + "env" = "staging"
                }
              + notebook_path   = "notebooks/TriggerModelDeploy"
            }
        }
    }

  # databricks_mlflow_experiment.experiment will be created
  + resource "databricks_mlflow_experiment" "experiment" {
      + creation_time    = (known after apply)
      + description      = "MLflow Experiment used to track runs for mlops-stacks-102-nofs project."
      + experiment_id    = (known after apply)
      + id               = (known after apply)
      + last_update_time = (known after apply)
      + lifecycle_stage  = (known after apply)
      + name             = "/Users/chiayui.lee@databricks.com/_playground/mlops_stacks/projects/mlops-stacks-102-nofs/staging-mlops-stacks-102-nofs-experiment"
    }

  # databricks_mlflow_model.registered_model will be created
  + resource "databricks_mlflow_model" "registered_model" {
      + creation_timestamp     = (known after apply)
      + description            = (known after apply)
      + id                     = (known after apply)
      + last_updated_timestamp = (known after apply)
      + name                   = "staging-mlops-stacks-102-nofs-model"
      + registered_model_id    = (known after apply)
      + user_id                = (known after apply)
    }

  # databricks_permissions.batch_job_permissions will be created
  + resource "databricks_permissions" "batch_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_VIEW"
        }
    }

  # databricks_permissions.mlflow_experiment_permissions will be created
  + resource "databricks_permissions" "mlflow_experiment_permissions" {
      + experiment_id = (known after apply)
      + id            = (known after apply)
      + object_type   = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_READ"
        }
    }

  # databricks_permissions.mlflow_model_permissions will be created
  + resource "databricks_permissions" "mlflow_model_permissions" {
      + id                  = (known after apply)
      + object_type         = (known after apply)
      + registered_model_id = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_READ"
        }
    }

  # databricks_permissions.training_job_permissions will be created
  + resource "databricks_permissions" "training_job_permissions" {
      + id          = (known after apply)
      + job_id      = (known after apply)
      + object_type = (known after apply)

      + access_control {
          + group_name       = "users"
          + permission_level = "CAN_VIEW"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + mlops-stacks-102-nofs_batch_inference_job_id = (known after apply)
  + mlops-stacks-102-nofs_experiment_id          = (known after apply)
  + mlops-stacks-102-nofs_experiment_name        = "/Users/chiayui.lee@databricks.com/_playground/mlops_stacks/projects/mlops-stacks-102-nofs/staging-mlops-stacks-102-nofs-experiment"
  + mlops-stacks-102-nofs_model_name             = "staging-mlops-stacks-102-nofs-model"
  + mlops-stacks-102-nofs_training_job_id        = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>